{"file":"posts/2014-12-08-im-learning-haskell-for-real-this-time.md","type":"posts","slug":"posts/im-learning-haskell-for-real-this-time","date":"2014-12-08T00:00:00.000Z","title":"I'm Learning Haskell For Real This Time","author":"shane","layout":"post","categories":["All Posts","Programming"],"tags":["elixir","erlang","functional programming","golang","haskell"],"alias":["/im-learning-haskell-for-real-this-time/"],"image":"plank-over-lake.jpeg","description":"About a couple of years ago, I was looking for something to add to my programming toolbox. Follow me on my journey of learning Haskell.","content":"<p>About a couple of years ago, I was looking for something to add to my metaphoric programming toolbox. That something needed to push me beyond PHP and C#. My initial desires were performance related (I mean PHP isn&#39;t really known for it&#39;s blistering speed), and as I thought about the possibilities, a paradigm shift wasn&#39;t out of the question. And so, my quest began.</p>\n<!--more-->\n<h2 id=\"go-for-a-bit\">Go for a bit</h2>\n<p>To keep things a bit easier for myself, my first stop was something that resembled what I already knew: <a href=\"https://golang.org/\">Go</a>. As &quot;an open source programming language that makes it easy to build simple, reliable, and efficient software&quot;, I figured it be right up my alley with what I was trying to achieve.</p>\n<center>\n  <amp-img width=\"250\" height=\"340\" src=\"https://golang.org/doc/gopher/frontpage.png\" alt=\"The Go gopher\" /></p>\n\n  <p>\n    <sup><i>the Go gopher</i></sup>\n  </p>\n\n</center>\n\n<p>I found a web framework to use (<a href=\"https://revel.github.io/\">revel</a>) and built a basic blog that resembled <a href=\"https://github.com/natew/obtvse2&quot;\">Obtvse 2</a>. The simplicity of the language make the work quick, and I felt efficient which isn&#39;t always the case when I come across a new language. I went on to create a few learning projects in the language, contributing (or attempting to) to open source projects when I saw fit, but yet, I felt there was something off about the way things were going. <em>N.B. I later came to know this was because of my use of a rigid framework when starting to use Go, so I wasn&#39;t feeling close to the language itself.</em></p>\n<h2 id=\"haskell-intro\">Haskell intro</h2>\n<p>Venturing on, I decided to try this thing I&#39;d been hearing a lot about: <a href=\"https://www.haskell.org/\">Haskell</a>. According to its homepage, &quot;Haskell makes it easier to produce flexible, maintainable, high-quality software&quot;, and that&#39;s every software developer&#39;s goal, right?</p>\n<p>Probably sometime between <a href=\"http://www.well-typed.com/blog/2014/09/how-we-might-abolish-cabal-hell-part-1/\">Cabal Hell</a>, trying to wrap my head around monads, and deciphering all of the operators in use in Haskell source files, I started drifting away from learning Haskell. I remained interested in what it offered, but I was impatient and didn&#39;t have the extra time to devote to everything that revolves around the language.</p>\n<h2 id=\"erlang-with-elixir-soon-behind-\">Erlang (with Elixir soon behind)</h2>\n<p>While having a go at Go and taking a small detour with Haskell, I ran across <a href=\"http://www.chicagoboss.org/\">ChicagoBoss</a>, a web framework for <a href=\"http://www.erlang.org\">Erlang</a>. Now, this was a few months before the big WhatsApp purchase by Facebook, but I still had heard of Erlang and its use in scalable and fault-tolerant soft real-time systems. I looked things over, went through some tutorials, built some skeleton projects, and even wrote about <a href=\"{% post_url 2013-10-03-implementing-user-authentication-with-bcrypt-in-chicagoboss %}\" title=\"Implementing User Authentication with bcrypt in ChicagoBoss\">a pain-point for some people</a>. By all accounts, this framework and language combination was bitchin&#39;.</p>\n<center>\n  <amp-img width=\"227\" height=\"95\" alt=\"Elixir logo\" src=\"http://elixir-lang.org/images/logo/logo.png\" />\n</center>\n\n<p>I soon came across a readme doc in the ChicagoBoss repo about using something called &quot;Elixir&quot; in ChicagoBoss projects. <em>Hmm</em>, I wondered. <em>What&#39;s this thing?</em> After heading the the <a href=\"http://elixir-lang.org/\">Elixir homepage</a> and reading that it leverages the Erlang VM and interoperates with Erlang code, offers a more inviting syntax (I later appreciated the Erlang syntax more), and includes nifty features including hygenic macros and the pipe operator, furious Googling ensued.</p>\n<p>Over the next year or so, I managed to write the API server for my <a href=\"https://www.chatblend.com/\" title=\"ChatBlend\">old startup</a>, open source numerous projects (<a href=\"https://sugar-framework.github.io/\" title=\"Sugar\">1</a>, <a href=\"https://github.com/slogsdon/mandrillex\" title=\"Mandrillex\">2</a>, <a href=\"https://github.com/slogsdon/stripe-elixir\" title=\"Stripe\">3</a>, <a href=\"https://github.com/slogsdon/placid\" title=\"Placid\">4</a>), and work as a contractor building a concurrent and distributed team collaboration protocol, using Elixir pretty much full-time. The experiences with each one really opened my eyes to functional programming. The composability and testability of pure functions. The possibility of statelessness (ignoring the state of OTP <code>gen_server</code>s). The basic simplicity of it all.</p>\n<p>While I love Erlang and Elixir and being able to just let it crash, relying on a virtual machine to run my code isn&#39;t something I want to do everyday. I&#39;m a big fan of getting native binaries with my portability.</p>\n<h2 id=\"haskell-for-a-second-time\">Haskell for a second time</h2>\n<p>So through this past year, I&#39;ve realized I&#39;m drawn to certain language features:</p>\n<ul>\n<li>purely functional</li>\n<li>statically typed</li>\n<li>ability for abstractions</li>\n<li>expressiveness</li>\n<li>usable tooling</li>\n<li>third-party packages/libraries</li>\n</ul>\n<p>Can those be used to describe Haskell? Yes. Can other programming languages be described in the same manner? Definitely. Why Haskell?</p>\n<p>Personally, I feel as though Haskell is a good fit for me so I can make better software, with being able to leverage its type system and easily know when my functions become impure (and thus, need more tests) both having the biggest influence over me writing better code. <em>Sidebar: Everyone who writes software or wants to learn how should take a look at language choices, deciding on one or a few for their own needs and not based on what&#39;s hip or cool at the time.</em></p>\n<p>Another reason why I want to learn Haskell? I like challenges. So, how am I planning on overcoming the challenge of learning Haskell? I&#39;m not entirely sure of everything needed, but here are a few things that should help me along the way:</p>\n<ul>\n<li><a href=\"http://bitemyapp.com/\">Chris Allen</a>&#39;s (<strong><a href=\"https://twitter.com/bitemyapp\">@bitemyapp</a></strong>) <a href=\"https://github.com/bitemyapp/learnhaskell\">recommended path for learning Haskell</a></li>\n<li><a href=\"http://stephendiehl.com/\">Stephen Diehl</a>&#39;s (<strong><a href=\"https://twitter.com/smdiehl\">@smdiehl</a></strong>) <a href=\"http://dev.stephendiehl.com/hask/\">&quot;What I Wish I Knew When Learning Haskell&quot;</a></li>\n<li><a href=\"http://www.codewars.com/\">codewars</a> katas</li>\n</ul>\n<p>Wish me luck!</p>\n"}