{"file":"posts/2013-12-20-migrate-your-site-without-killing-your-search-engine-presence.md","type":"posts","slug":"posts/migrate-your-site-without-killing-your-search-engine-presence","date":"2013-12-20T00:00:00.000Z","title":"Migrate Your Site Without Killing Your Search Engine Presence","author":"shane","layout":"post","categories":["All Posts","DevOps","Programming"],"tags":["apache","devops","migration","nginx","redirects"],"alias":["/migrate-your-site-without-killing-your-search-engine-presence/","/posts/devops/migrate-your-site-without-killing-your-search-engine-presence/"],"image":"view-down-alley.jpeg","description":"SEO is a hard beast to tame. Once you have everything just right, moving to a new platform, a new URL structure, or even a new domain can be stressful without taking the necessary steps first.","content":"<p>Let&#39;s face it. Search engine optimization (SEO) is a hard beast to tame. Once you have everything just right, moving to a new platform, a new URL structure, or even a new domain can be stressful without taking the necessary steps first. Oh, you need a guide? Let me walk you through.</p>\n<!--more-->\n<h2 id=\"preparation\">Preparation</h2>\n<h3 id=\"is-this-really-necessary-\">Is this really necessary?</h3>\n<p>Do yourself a solid, and ask yourself these questions. If you&#39;re moving to a new platform, is there a way to set your routes and resources to use the same URL structure that you&#39;re currently using? Are your current URLs really that bad? If a new domain, why is it necessary to switch?</p>\n<p>Really thinking about and answering those questions will make sure you&#39;re going through with this for the right reasons. Prepare for possible enhancements in the future.</p>\n<h3 id=\"determine-new-url-structure\">Determine new URL structure</h3>\n<p>Looking to your application for what&#39;s possible and looking to your content for what&#39;s available, this is where you decide on your new URL structure. Be concise with what you decide. You don&#39;t need or want super long URLs. They also need to be a nice mix of simplicity and proper hierarchy for SEO benefits.</p>\n<p>This step is mostly on you. Make wise decisions that make sense for your content. Take into account conventions used by others.</p>\n<h3 id=\"how-are-the-redirects-going-to-be-handled-\">How are the redirects going to be handled?</h3>\n<p>Like it or not, this process is not immediate. There are going to be links somewhere that will be using the your old URL structure, whether they be bookmarks, links in forum or blog posts, search engine listings, etc. We want to be sure you don&#39;t lose the traffic from those links, so redirects are going to be the key to your success in this endeavor.</p>\n<h4 id=\"letting-your-web-server-handle-it\">Letting your web server handle it</h4>\n<p>Web server based redirects will be your best bet. They will help reduce latency in the request by redirecting it before your application has a chance to touch it. Seeing that <a href=\"http://httpd.apache.org/\">Apache</a> and <a href=\"http://nginx.org/\">nginx</a>, there will be examples of ways to set up the redirects in both later in this section. In any case, we want to use permanent (301) redirects to let browsers and search engine bots know that the old resource will never be used again and to remember the new URL.</p>\n<p>If you&#39;re using a control panel like CPanel, Plesk, etc., you may have the option to set up your redirects through the control panel. Beware that some, like Plesk, use temporary (302) redirects which are not desired. In those cases, you will want to set up your redirect rules manually with a <code>.htaccess</code> file. Hosts with control panels typically use Apache for the web server, so <code>.htaccess</code> files, which are Apache-specific, will work just fine. If nginx is used, a <code>.htaccess</code> file will accomplish nothing, so redirect will need to be set up in the virtual host config file for the domain.</p>\n<h5 id=\"side-note-for-static-sites-on-github-pages-3-or-s3-4-\">Side note for static sites on <a href=\"https://pages.github.com/\">GitHub Pages</a> or <a href=\"http://aws.amazon.com/s3/\">S3</a></h5>\n<p>Since static site generators and hosting on GitHub or S3 are all the rage right now, I should make a couple notes.</p>\n<p>If you&#39;re using S3, congratulations! Follow the <a href=\"http://docs.aws.amazon.com/AmazonS3/latest/dev/how-to-page-redirect.html#page-redirect-using-console\">AWS docs</a>, and set up your redirects in the AWS S3 console.</p>\n<p>If you&#39;re using GitHub Pages, bad news bears for you. Redirects are not yet supported by the web server, so you&#39;re reduced down to using Javascript or a meta refresh if you want your website to handle the redirect. Doing either of those, you will want to add a <code>&lt;link rel=&quot;canonical&quot; href=&quot;http://www.yourdomain.com/...&quot;&gt;</code> to prevent duplicate content as the redirects are only issued as temporary (302).</p>\n<h5 id=\"examples\">Examples</h5>\n<p>The following are just examples for Apache and nginx. You will need to adjust/add to these to match your use case.</p>\n<h6 id=\"apache\">Apache</h6>\n<p>These can be placed in your virtual host config file in a <code>&lt;Directory&gt;</code> node or in a <code>.htaccess</code> file:</p>\n<pre><code class=\"hljs language-conf\"># Redirecting basic matches using Redirect.\n# Be sure to list more precise rules first. They are interpreted in order\nRedirect permanent /s/your-awesome-service http://www.yourdomain.com/services/your-awesome-service\nRedirect permanent /post-about-something http://www.yourdomain.com/posts/post-about-something\nRedirect permanent /s http://www.yourdomain.com/services\n\n# Redirecting using mod_rewrite (if available)\n# Be sure to list more precise rules first. They are interpreted in order\nRewriteEngine on\nRewriteRule ^/s/(.+)$ http://www.yourdomain.com/services/$1 [R=301,L]\nRewriteRule ^/s$ http://www.yourdomain.com/services [R=301,L]\n# Treat all other requests as posts\nRewriteRule ^(.+)$ http://www.yourdomain.com/posts$1 [R=301,L]\n</code></pre>\n<h6 id=\"nginx\">nginx</h6>\n<p>These will need to be placed in a <code>server</code> configuration block:</p>\n<pre><code class=\"hljs language-nginx\"><span class=\"hljs-comment\"># exact match for /s</span>\n<span class=\"hljs-attribute\">location</span> = /s {\n    <span class=\"hljs-attribute\">rewrite</span><span class=\"hljs-regexp\"> ^</span> http://www.yourdomain.com/services <span class=\"hljs-literal\">permanent</span>;\n}\n\n<span class=\"hljs-comment\"># match all requests under /s/</span>\n<span class=\"hljs-attribute\">rewrite</span><span class=\"hljs-regexp\"> ^/s/(.+)$</span> http://www.yourdomain.com/services/<span class=\"hljs-variable\">$1</span> <span class=\"hljs-literal\">permanent</span>;\n\n<span class=\"hljs-comment\"># exact match for /post-about-something</span>\n<span class=\"hljs-attribute\">location</span> = /post-about-something {\n    <span class=\"hljs-attribute\">rewrite</span><span class=\"hljs-regexp\"> ^</span> http://www.yourdomain.com/posts/post-about-something <span class=\"hljs-literal\">permanent</span>;\n}\n</code></pre>\n<h4 id=\"your-application-is-next-up\">Your application is next up</h4>\n<p>If you cannot or are unwilling to set up your redirects using your web server, your next best option is probably going to be your application.</p>\n<p>For applications similar to WordPress with large plugin/extension libraries, look for one that will handle the redirects for you. WordPress, as an example, has the <a href=\"http://wordpress.org/plugins/redirection/\">Redirection</a> plugin.</p>\n<p>For frameworks and some languages, there will typically be a method somewhere to allow for the redirect, otherwise, you will need to set the HTTP status code and <code>Location</code> header with the new location manually as long as you haven&#39;t started sending a response to the end-user. Router configurations are a great place for setting redirect rules. If your using a MVC framework, your controller actions could be another option.</p>\n<p>With .NET, you can use something like this:</p>\n<pre><code class=\"hljs language-csharp\"><span class=\"hljs-comment\">// .NET versions &lt; 4.0</span>\nResponse.Redirect(newLocation, <span class=\"hljs-literal\">false</span>);\nResponse.StatusCode = <span class=\"hljs-number\">301</span>;\nResponse.End();\n\n<span class=\"hljs-comment\">// .NET versions 4.0+</span>\nResponse.PermanentRedirect(newLocation);\n</code></pre>\n<p>You can use this in PHP:</p>\n<pre><code class=\"hljs language-php\">header(<span class=\"hljs-string\">'HTTP/1.1 301 Moved Permanently'</span>);\nheader(<span class=\"hljs-string\">'Location: '</span> + newLocation);\n<span class=\"hljs-keyword\">exit</span>();\n</code></pre>\n<h3 id=\"let-the-search-engines-know\">Let the search engines know</h3>\n<p>This is one of the simpler steps in the process, but it can be quite important. Create an up-to-date version of your sitemap, whether it be a true sitemap, a RSS feed, or an Atom feed. Along with sending 301 redirects for your old links, this will tell the search engines to crawl your site again, looking for your content at the new URLs in the process. By having the proper URL in the search engine results, this also helps your end-users (your audience) from having to follow a redirect, which is even more important when they are using mobile devices.</p>\n<h2 id=\"execution\">Execution</h2>\n<p>Since I&#39;ve recently decided that my own site was in need of change, we&#39;ll walkthrough my decisions and actions with migrating to a new URL strucure and a new domain.</p>\n<h3 id=\"is-this-necessary-\">Is this necessary?</h3>\n<p><em>If you&#39;re moving to a new platform, is there a way to set your routes and resources to use the same URL structure that you&#39;re currently using?</em> I&#39;m moving to using <a href=\"http://jekyllrb.com/\">Jekyll</a> on <a href=\"https://pages.github.com/\">GitHub Pages</a>, so yes is the answer to this question. Jekyll has the ability to set a permalink structure that can mimic a multitude of possibilities, even setting it on a post-by-post basis.</p>\n<p><em>Are your current URLs really that bad?</em> Yes, the were. My old application (which was based on another) only allowed for a single level for the site&#39;s hierarchy without expanding on the functionality. Could I have done that? Yes. Did I want to do more than I already had (I had added the ability for categories by extending the use of the posts&#39; slugs)? No, because I&#39;m lazy. I didn&#39;t want to put in the extra time involved with modifying my old application.</p>\n<p><em>If a new domain, why is it necessary to switch?</em> This is mainly for an imporvement on my email. I currently have a rather long email address (shane@shanelogsdon.com), but I want a nice simple email (shane@logsdon.io). This doesn&#39;t simplify my web site&#39;s URL (same amount of characters) unless I take home on the root domain (logsdon). It does, however, match my email, which makes sense to me. With this domain change, I can add family members easily, if they&#39;d like, to email and hosting.</p>\n<h3 id=\"determining-new-urls\">Determining new URLs</h3>\n<p>I want a nice and simple URL structure for my own content. This is what I came up with:</p>\n<pre><code>/posts/[category]/[post]\n/categories/[category]\n/projects/[project]\n/contact/\n/videos/ (for eventual screencasts)\n</code></pre><p>This will lend to being able to add new sections as I desire, such as the &quot;videos&quot; portion that I will eventually have for screencasts. It&#39;s simple. It lets me organize the content in a sensible manner.</p>\n<h3 id=\"setting-up-my-redirects\">Setting up my redirects</h3>\n<p>I only had a short list of links that I needed to worry. Here they are with there they will point to on the new site:</p>\n<pre><code>/\n    -&gt; http://slogsdon.com/\n/installing-nginx-percona-php-fpm-with-homebrew-on-mountain-lion\n    -&gt; /posts/devops/installing-nginx-percona-php-...\n/linux-and-net-should-be-friends\n    -&gt; /posts/net/linux-and-net-...\n/using-obtvse\n    -&gt; /posts/ruby/using-obtvse\n/migrating-from-mysql-server-to-percona-server\n    -&gt; /posts/devops/migrating-from-mysql-...\n/vagrant-is-awesome\n    -&gt; /posts/devops/vagrant-is-awesome\n/im-already-tired-of-rails-already\n    -&gt; /posts/ruby/im-already-tired-...\n/chicagoboss\n    -&gt; /posts/erlang/chicagoboss\n/migrating-to-acvte\n    -&gt; /posts/golang/migrating-to-acvte\n/erlang/implementing-user-authentication-with-bcrypt-in-chicagoboss\n    -&gt; /posts/erlang/implementing-user-authen...\n/list/get-awesome-with-list---nov-2013\n    -&gt; /posts/list/get-awesome-with-list-nov-2013\n/elixir/writing-api-wrappers-with-elixir\n    -&gt; /posts/elixir/writing-api-wra...\n</code></pre><p>I ran into some luck with my redirects since I was moving to GitHub pages where redirects cannot be done with the web server. Because I was moving to a different domain as well, I left my old domain pointed to my cloud server, setting up my redirects in my nginx <code>shanelogsdon.com</code> server block.</p>\n<h3 id=\"updating-my-sitemap\">Updating my sitemap</h3>\n<p>After creating a new Atom feed with Jekyll, I submitted it to my Google Webmasters Tools account. While most (read all) of my organic traffic comes from Google, I decided this would be a nice chance to see it anyone actually uses Bing, so I submitted to Bing&#39;s webmasters tools as well. I know what you&#39;re thinking, and I didn&#39;t know Bing had a set of webmasters tools as well.</p>\n<h2 id=\"post-mortem\">Post-Mortem</h2>\n<p>Following the steps outlined above, I was able to change domains and URL structure for all of my content without a loss in traffic. My cloud server continues to redirect requests to my old application/domain, and both Bing and Google have the new URLs and domain in their search results.</p>\n<p>Overall, it looks like I&#39;ll get through this alive. If you need to go through this process as well, I hope that the steps detailed above will help guide you to success.</p>\n"}