{"file":"posts/2013-08-07-vagrant-is-awesome.md","type":"posts","slug":"posts/vagrant-is-awesome","date":"2013-08-07T00:00:00.000Z","title":"Vagrant is Awesome","author":"shane","layout":"post","categories":["All Posts","DevOps"],"tags":["devops","phalcon","php","vagrant"],"alias":["/vagrant-is-awesome/"],"content":"<p>I&#39;ve been working on PHP web apps for years, and over time, my development workflow has remained fairly constant:</p>\n<ol>\n<li>Configure new app in apache/nginx</li>\n<li>Starting coding to find out my environment is broken</li>\n<li>Fix my environment</li>\n<li>Continue coding</li>\n<li>Get bored</li>\n<li>See step 1</li>\n</ol>\n<p>Managing DevOps items when I should be focusing on building a product is not beneficial to my productivity.</p>\n<!--more-->\n<h2 id=\"enter-vagrant-1-\">Enter <a href=\"http://www.vagrantup.com/\">Vagrant</a>.</h2>\n<p>Ever wanted to have a dev environment built for you automatically? Yeah, who doesn&#39;t? Vagrant can do that for you. With the help of Oracle&#39;s <a href=\"https://www.virtualbox.org/\">VirtualBox</a>, Vagrant creates a virtual machine, can provision it with the packages and services you define in a text file, and creates helpful links in between your host OS and the guest OS.</p>\n<h2 id=\"-phalcon-php-3-\"><a href=\"http://www.phalconphp.com/\">Phalcon PHP</a></h2>\n<p>I need to write another post entitled &quot;Phalcon is Awesome&quot;. I&#39;ve only recently started to develop with the C-extension based PHP framework, but boy does it pack a punch. One phrase before I do a write-up: <a href=\"http://systemsarchitect.net/performance-benchmark-of-popular-php-frameworks/\" title=\"Performance benchmarks of PHP frameworks\">~800 requests per second</a>.</p>\n<p>The only downside of using Phalcon is having to compile and load it for use by PHP. <code>git clone</code>-ing the <a href=\"https://github.com/phalcon/cphalcon\">cphalcon repo</a> and running the build script is easy enough, but what if you&#39;re getting help from a creative that has no idea how to set up a virtual host on their local machine, let alone compiling a PHP extension?</p>\n<h2 id=\"use-vagrant-of-course-\">Use Vagrant, of course!</h2>\n<p>I&#39;ve been using Vagrant to host a Phalcon project for a while, and I managed to extract out the Vagrant goodies into a stand-alone project: <a href=\"https://github.com/slogsdon/vagrant-phalcon\">vagrant-phalcon</a>. With the help of a Puppet manifest and a bash script, vagrant-phalcon helps developers of all skill levels start with Phalcon with an easy <code>vagrant up</code> command. Details from the README.md:</p>\n<blockquote>\n<h4 id=\"getting-started\">Getting Started</h4>\n<ol>\n<li>Download and install <a href=\"https://www.virtualbox.org/\">VirtualBox</a></li>\n<li>Download and install <a href=\"http://www.vagrantup.com/\">Vagrant</a></li>\n<li>Clone this repo</li>\n<li>Run <code>vagrant up</code> in the repo directory</li>\n<li>Visit <code>http://localhost:8081/</code> in your favorite browser</li>\n</ol>\n<h5 id=\"note\">Note</h5>\n<p>Nginx is configured by default to use <code>./src/Public/</code> as the root directory. If your public directory differs, be sure to update the <code>Vagrantfile</code> to reflect your needs.</p>\n</blockquote>\n<p>While not perfect, it does the job of setting up a Phalcon dev environment quite well, so I felt content with releasing it out into the wild. Happen to find a problem with it or have a suggestion? Submit an <a href=\"https://github.com/slogsdon/vagrant-phalcon/issues\">issue</a>, or better yet, submit a <a href=\"https://github.com/slogsdon/vagrant-phalcon/pulls\">pull-request</a>.</p>\n<p>Here&#39;s an ascii-cast walkthrough:</p>\n"}