{"file":"posts/2013-08-31-migrating-to-acvte.md","type":"posts","slug":"posts/migrating-to-acvte","date":"2013-08-31T00:00:00.000Z","title":"Migrating to Acvte","author":"shane","layout":"post","categories":["All Posts","DevOps"],"tags":["acvte","devops","golang","rails"],"alias":["/migrating-to-acvte/"],"content":"<p>Remember <a href=\"http://shanelogsdon.com/im-already-tired-of-rails-already\">this</a>? I do. I finally got <a href=\"https://github.com/slogsdon/acvte\">acvte</a> to a point where I was comfortable using it in production for this website.</p>\n<!--more-->\n<p>So far, the performance improvement has been totally worth the sixteen days it has taken to get to this point. Check out the memory usage drop that I grabbed from NewRelic:</p>\n<center>\n  <amp-img width=\"640\" height=\"254\" src=\"http://i.imgur.com/J57L8U7.png\" alt=\"\" />\n</center>\n\n<p>And a more quantitative view:</p>\n<center>\n  <amp-img width=\"340\" height=\"480\" src=\"http://i.imgur.com/HaFbS2x.png\" alt=\"\" />\n</center>\n\n<p>Right before 12:05 is when I flipped the switch[^1]. I killed the config using the rails-based <a href=\"https://github.com/natew/obtvse2\">obtvse2</a> and migrated to the one using acvte. The drop in the graph above shows that switch in more of a defined manner than I was expecting.</p>\n<p>The table above details the actual memory usage of both apps. Obtvse2, well rails actually, was using 113MB, an average amount across the app&#39;s lifespan. Acvte, on the other hand, was only using 8MB. Here&#39;s a fun fact. Three instances of acvte (<code>blog</code>, <code>acvte</code>, and <code>bash</code> in the table) combined used only ~21% of the memory used by the rails app. The <code>bash</code> instance was me running acvte in dev mode for some debugging, while the other two were running via <code>upstart</code>.</p>\n<p>Sadly, I don&#39;t have definitive numbers on app response time from the server as NewRelic doesn&#39;t support Go at the moment, although I can estimate using Chrome Developer Tools. NewRelic is showing that obtvse2 had an average response time of 67ms. Chrome shows an estimated average response time of 4ms, assuming response time is Time &#8211; Latency[^2].</p>\n<h2 id=\"on-the-whole-preparation-h-feels-good-4-\">On the whole, <a href=\"http://www.youtube.com/watch?v=mi5kXcc-TJ8\">Preparation H feels good</a></h2>\n<p>Go has left me wanting more. I just want more. More time with it. More projects written in it. Development time with it is quick, writing, compiling, and running, while the code is concise and easy to read for when I don&#39;t document (considering my track record with code, that will be most of the time).</p>\n<p>[^1]: Obtvse2 was running as a Passenger app, while acvte was running as itself. Both were reverse-proxied from nginx, had varnish acting as an edge cache, and were running on a 1GB Memory, 1 Core, 30GB SSD cloud instance from DigitalOcean.\n[^2]: Definition of Time (total duration) and Latency (time to first byte) from <a href=\"https://developers.google.com/chrome-developer-tools/docs/network\">Google</a>.</p>\n"}