{"file":"posts/2015-04-25-wordpress-docker-and-you.md","type":"posts","slug":"posts/wordpress-docker-and-you","date":"2015-04-25T00:00:00.000Z","title":"WordPress, Docker, and You","author":"shane","layout":"post","categories":["All Posts","DevOps"],"tags":["deployment","devops","docker","php","wordpress"],"alias":["/wordpress-docker-and-you/"],"image":"formations-on-beach.jpeg","description":"Wordpress, Docker, and your site can work together in harmony with the right configuration. Follow along as I spill the beans.","content":"<p>Once again, I got bored with my website and decided to change it up. I was using <a href=\"http://jaspervdj.be/hakyll/\">Hakyll</a> to generate a set of static files, which were then hosted on <a href=\"https://pages.github.com/\">GitHub Pages</a>. Now, I think GitHub pages is great and had been happy hosting my website there for a couple of years now, but with some projects I have in the works, I wanted to go with an actual CMS for a while.</p>\n<p>Being a developer, I love me some version control systems and keeping up with emerging technologies, so for the latest version of my site, <a href=\"https://wordpress.org/\">WordPress</a>, <a href=\"https://www.docker.com/\">Docker</a>, and <a href=\"https://getcomposer.org/\">Composer</a> let me blend those two ideas to create something repeatable, scalable, and updatable. Using the following steps, you too can employ these tools to supercharge the setup and deployment of your WordPress site(s).</p>\n<!--more-->\n<h2 id=\"disclaimer\">Disclaimer</h2>\n<p>While I have some pretty extensive experience developing, hosting, managing, and tuning WordPress installations, I am by no means an expert. I am using the following information to host my own website (the one you&#39;re reading right now), but your mileage can and will vary. Do your due diligence before running a stack like this in production.</p>\n<h2 id=\"preparation\">Preparation</h2>\n<p>Here are a few things you&#39;ll need:</p>\n<ul>\n<li>a host environment. This can be a <a href=\"https://www.vagrantup.com/\">Vagrant</a> instance or a server through your VPS provider.</li>\n<li>Docker and a compatible OS. Take a look at the <a href=\"https://docs.docker.com/installation/#installation\">installation guides</a> for tips.</li>\n<li>a set of WordPress files. If you&#39;re not using a VCS, step 1 below can be skipped, but you should consider versioning your code.</li>\n</ul>\n<h2 id=\"the-steps\">The Steps</h2>\n<h3 id=\"1-prepare-your-workspace-with-git-and-composer\">1. Prepare Your Workspace with Git and Composer</h3>\n<p>What&#39;s Composer? Straight from the <a href=\"https://getcomposer.org/doc/00-intro.md#introduction\">horse&#39;s mouth</a>:</p>\n<blockquote>\n<p>Composer is a tool for dependency management in PHP. It allows you to declare the dependent libraries your project needs and it will install them in your project for you.</p>\n</blockquote>\n<p>Sounds great, huh? With a little help, we can use Composer to keep our dependencies (WordPress, plugins, themes, and more) and use Git to keep track of everything else. Let&#39;s check out this very site to see how this can be done.</p>\n<pre><code>$ git clone https://github.com/slogsdon/slogsdon.com\n$ cd slogsdon.com\n$ composer install\n</code></pre><p>I&#39;ve cloned the site&#39;s repository from GitHub which contains, among other things, a <code>composer.json</code> file, a manifest that lets Composer know what to download, from where to download, and to where the files need to be placed.</p>\n<pre><code class=\"hljs language-json\">{\n  <span class=\"hljs-attr\">\"name\"</span>: <span class=\"hljs-string\">\"slogsdon/slogsdon.com\"</span>,\n  <span class=\"hljs-attr\">\"homepage\"</span>: <span class=\"hljs-string\">\"https://github.com/slogsdon/slogsdon.com\"</span>,\n  <span class=\"hljs-attr\">\"license\"</span>: <span class=\"hljs-string\">\"MIT\"</span>,\n  <span class=\"hljs-attr\">\"authors\"</span>: [\n    {\n      <span class=\"hljs-attr\">\"name\"</span>: <span class=\"hljs-string\">\"Shane Logsdon\"</span>,\n      <span class=\"hljs-attr\">\"email\"</span>: <span class=\"hljs-string\">\"shane@shanelogsdon.com\"</span>,\n      <span class=\"hljs-attr\">\"homepage\"</span>: <span class=\"hljs-string\">\"http://www.slogsdon.com\"</span>,\n      <span class=\"hljs-attr\">\"role\"</span>: <span class=\"hljs-string\">\"Developer\"</span>\n    }\n  ],\n  <span class=\"hljs-attr\">\"repositories\"</span>: [\n    {\n      <span class=\"hljs-attr\">\"type\"</span>: <span class=\"hljs-string\">\"composer\"</span>,\n      <span class=\"hljs-attr\">\"url\"</span>: <span class=\"hljs-string\">\"http://wpackagist.org\"</span>\n    }\n  ],\n  <span class=\"hljs-attr\">\"require\"</span>: {\n    <span class=\"hljs-attr\">\"php\"</span>: <span class=\"hljs-string\">\"&gt;=5.4\"</span>,\n    <span class=\"hljs-attr\">\"johnpbloch/wordpress\"</span>: <span class=\"hljs-string\">\"4.1.1\"</span>,\n    <span class=\"hljs-attr\">\"slogsdon/staticwp\"</span>: <span class=\"hljs-string\">\"*@dev\"</span>,\n    <span class=\"hljs-attr\">\"wpackagist-plugin/google-analytics-for-wordpress\"</span>: <span class=\"hljs-string\">\"*\"</span>,\n    <span class=\"hljs-attr\">\"wpackagist-plugin/jetpack\"</span>: <span class=\"hljs-string\">\"*\"</span>,\n    <span class=\"hljs-attr\">\"wpackagist-plugin/wordpress-seo\"</span>: <span class=\"hljs-string\">\"*\"</span>\n  },\n  <span class=\"hljs-attr\">\"extra\"</span>: {\n    <span class=\"hljs-attr\">\"wordpress-install-dir\"</span>: <span class=\"hljs-string\">\"wp\"</span>,\n    <span class=\"hljs-attr\">\"installer-paths\"</span>: {\n      <span class=\"hljs-attr\">\"wp/wp-content/plugins/{$name}\"</span>: [<span class=\"hljs-string\">\"type:wordpress-plugin\"</span>],\n      <span class=\"hljs-attr\">\"wp/wp-content/themes/{$name}\"</span>: [<span class=\"hljs-string\">\"type:wordpress-theme\"</span>],\n      <span class=\"hljs-attr\">\"wp/wp-content/mu-plugins/{$name}\"</span>: [<span class=\"hljs-string\">\"type:wordpress-muplugin\"</span>]\n    }\n  }\n}\n</code></pre>\n<p>Once in the directory, <code>composer install</code> reads this manifest to download the dependencies listed in the <code>require</code> property. All of the WordPress related files get installed to their proper locations under the <code>wp</code> directory and everything else is placed in the Composer default of <code>vendor</code>.</p>\n<h3 id=\"2-build-your-images-with-docker\">2. Build Your Images with Docker</h3>\n<p>Docker&#39;s been creating a buzz ever since its release in 2013, but in case you haven&#39;t heard about it, Docker is &quot;an open platform for distributed applications for developers and sysadmins.&quot; Without all the marketing lingo, Docker can let you create small, composable services, each in a somewhat isolated environment. It can be great for development setups or hosting a fleet of services across datacenters.</p>\n<p>My <code>composer.json</code> would get lonely all by itself, so lucky for it, it&#39;s joined by <code>docker-wordpress-fpm</code> and <code>docker-nginx-fpm</code>. Their names should give an indication of their purpose, but to spell things out, those two directories hold configurations for hosting the site with Docker. <code>docker-wordpress-fpm</code> describes a Docker image that hosts WordPress behind <a href=\"http://php.net/manual/en/install.fpm.php\">PHP-FPM</a>, a FastCGI process manager aimed at supporting heavy-loaded PHP websites and applications. Meanwhile, <code>docker-nginx-fpm</code> describes a Docker image for reverse-proxying PHP-FPM so that it responds to standard HTTP requests.</p>\n<pre><code>$ docker build --rm=true -t wordpress-fpm docker-wordpress-fpm\n$ docker build --rm=true -t nginx-fpm docker-nginx-fpm\n</code></pre><p>Both calls to <code>docker build</code> essentially perform the same action. They each build a Docker image, discarding intermediate steps (<code>--rm=true</code>), by reading a <code>Dockerfile</code> contained in a source directory (the last parameter of each line). The image is tagged with <code>-t [name]</code>, allowing us to reference the image when creating containers later down the road. If we&#39;re so inclined, we can tag our images as <code>[owner]/[name]</code> and push our images to the Docker registry, mostly used for public images but can be used for private ones.</p>\n<p>At this point, we&#39;ve merely created images, but we will need to run those images as containers for our new WordPress application to come to life.</p>\n<h3 id=\"3-run-mariadb-in-a-container\">3. Run MariaDB in a Container</h3>\n<p>Any good WordPress site is backed by a MySQL database, where all posts, pages, comments, options, etc. Back when WordPress was coming into its own, I&#39;m not sure if there was an alternative to MySQL, but today, developers who with a need for MySQL <em>do</em> have options, one of those being <a href=\"https://mariadb.org/\">MariaDB</a>.</p>\n<blockquote>\n<p>MariaDB 10 is an enhanced, high performance, free and open source alternative to MySQL that helps the world&#39;s busiest websites deliver more content faster.</p>\n</blockquote>\n<p>I don&#39;t know about you, but that sounds like something I want behind my website. Because MariaDB is entirely compatible with MySQL-backed services, there is nothing stopping me from getting it to serve my site&#39;s data to WordPress to display.</p>\n<pre><code>$ docker run -d --name mysql \\\n                --restart always \\\n                -e MYSQL_ROOT_PASSWORD=&quot;my-awesome-password&quot; \\\n                mariadb\n</code></pre><p>We can finally say we have a Docker container running. Let&#39;s run through what happened. <code>docker run</code> has the ability to run in detached mode, which <code>-d</code> represents, letting our service and its container continue to run in the background. Sanely named containers are easier to manage IMHO, so <code>--name mysql</code> will let us reference the container from other services and the command line by a simple <code>mysql</code>. Using <code>--restart always</code> alerts Docker to restart the container if it were to stop for whatever reason. There are other values available for this option, but with a service like this, it is best to use this restart policy.</p>\n<p>The -e option lets environment variables be set inside the container, in this case the root password for MariaDB. Many images allow for configuration via environment variables to increase reusability. Finally, we let <code>docker run</code> know what image we wish to run. This can refer to a local image or to a remote one, and in the case of remote images, they will be pulled from the registry if it is not already on the machine.</p>\n<h3 id=\"4-serve-wordpress-with-docker\">4. Serve WordPress with Docker</h3>\n<p>With our database running, it&#39;s time to get our site up and going as well.</p>\n<pre><code>$ docker run -d --name wordpress-fpm \\\n                --restart always \\\n                --link mysql:mysql \\\n                -v /path/to/slogsdon.com/wp:/var/www/html \\\n                wordpress-fpm\n$ docker run -d --name nginx-fpm \\\n                --restart always \\\n                --link wordpress-fpm:fpm \\\n                --volumes-from wordpress-fpm \\\n                -p 12345:80 \\\n                -e VIRTUAL_HOST=www.slogsdon.com \\\n                nginx-fpm\n</code></pre><p>Again, we&#39;re running our containers in detached mode (they are services after all) and passing similar options to <code>docker run</code> as we did with our <code>mysql</code> container. There are a few new options we are taking advantage of, so let&#39;s cover them since they help connect all of these containers. A big one is the <code>--link [container-name]:[name]</code> option which allows the container being started to connect to another container to use the resources exposed by the linked container. With the two containers above, <code>wordpress-fpm</code> links to <code>mysql</code> so WordPress has somewhere to save data, and <code>nginx-fpm</code> links to <code>wordpress-fpm</code> so it has something to reverse proxy. These two links are the driving force behind our new stack, so be sure that their <code>[container-name]</code>&#39;s match the names of your containers and the <code>[name]</code>&#39;s remain as is.</p>\n<blockquote>\n<p><strong>Note:</strong> The <code>wordpress-fpm</code> will use it&#39;s link to <code>mysql</code> to build a <code>wp-config.php</code> file for you when it is first run, configuring the basic options like database connection information and security keys. Now while this won&#39;t work for all sites, it will work for most, so look into using a custom <code>wp-config.php</code> if you run into issues</p>\n</blockquote>\n<p><code>-v [host-dir]:[container-dir]</code> lets you map a directory in the host environment to a volume in the Docker container, sharing whatever exists in that directory between the two. Each can have the possibility of writing to it (and usually do), so be careful here. The benefit of creating a volume in this manner is that you can recreate the container at a later time and will be able to reuse any data created/used by that container. This is great for WordPress sites for things like uploads where it is nice when they don&#39;t go missing. Boo 404&#39;s! <code>--volumes-from [container-name]</code> works with a linked container to share a volume between the two. Here, <code>nginx-fpm</code> will try to serve requested URLs from nginx before sending the request to PHP-FPM/Wordpress to handle, helping speed up your response times considering nginx is better at serving static files than PHP-FPM.</p>\n<h3 id=\"5-virtual-host-your-port-80-aka-time-for-magic\">5. Virtual Host Your Port 80 aka Time for Magic</h3>\n<p>At this point, you should have these three containers running on your host (your container ID&#39;s will be different, you&#39;ll see more information. I stripped some out for readability here):</p>\n<pre><code>$ docker ps\nCONTAINER ID        IMAGE                           NAMES\nf34fb2b343b1        slogsdon/nginx-fpm:latest       nginx-fpm\nc6ded963bd1c        slogsdon/wordpress-fpm:latest   wordpress-fpm\n936cacc00be0        mariadb:latest                  mysql\n</code></pre><p>You should also be able to venture to <code>http://[you-ip-here]:12345</code> and see something that resembles a WordPress site. That&#39;s great and all, but do you want your visitors to have to remember that port number? I don&#39;t think so. The fix for this is to use something to multiplex requests to port 80 (standard HTTP) based on domain name.</p>\n<p>For that, we look to nginx once again, and specifically, the <a href=\"https://registry.hub.docker.com/u/jwilder/nginx-proxy/\"><code>jwilder/nginx-proxy</code></a> Docker image. <code>jwilder/nginx-proxy</code> is where the magic happens thanks to its volume that gives it access to your host&#39;s Docker socket, allowing it to listen to Docker&#39;s events (like when containers start) and the options passed to them (like environment variables). It uses this information to recreate nginx virtual host configs on the fly when it sees a <code>VIRTUAL_HOST</code> environment variable attached to a container, and along with an exposed port (<code>-p [exposed-port]:[port-in-container]</code>), routes requests to your domain to the correct Docker container. Let&#39;s give it a go.</p>\n<pre><code>$ docker run -d --name nginx-proxy \\\n                --restart always \\\n                -v /var/run/docker.sock:/tmp/docker.sock \\\n                -p 80:80 \\\n                jwilder/nginx-proxy\n</code></pre><p>The <code>nginx-proxy</code> is now listening on port 80, and for any request to <code>www.slogsdon.com</code>, it sends those requests to the <code>nginx-fpm</code> container to serve! With such a generalized reverse proxy, you can keep a single container like <code>nginx-proxy</code> listening on port 80 and have multiple containers (sites) running on other ports and domains, and no one else would be the wiser. Each site would be running in its own environment, adding a small layer of security in case one of those sites gets compromised.</p>\n<h2 id=\"wrap-up\">Wrap Up</h2>\n<p>This is merely a peak into what&#39;s possible with WordPress and Docker, even though this post ended up fairly dense. Techniques like this are similar to those used by the big names in WordPress hosting, but if you&#39;re a smaller reseller/webmaster, this can help lower your hard costs while maintaining a better level of service for your customers.</p>\n<p>If this interested you, keep reading into <a href=\"https://docs.docker.com/userguide/\">Docker&#39;s documentation</a> to get to know the technology and any gotchas when running this stuff in production.</p>\n"}